tutorials/cases/prescribedUsCases/converging/constant/reactions
species
(
    N2
);

reactions
{
}
