tutorials/cases/prescribedUsCases/converging/constant/solidThermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      solidThermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType solidMixtureThermo<constHeterogeneous>;

// Single inert solid species: the thing the prescribed Us advects.
solidComponents ( char );

charCoeffs
{
    transport
    {
        K           0.156;
    }
    thermodynamics
    {
        Cp          1054;
        Hf          -2.12e4;
    }
    density
    {
        rho         1050;
    }
};

// ************************************************************************* //
